#=========================================================================
#      ---------------| Tap |---------------
#=========================================================================
tap "homebrew/bundle"
tap "homebrew/services"
#=========================================================================
#      ---------------| Productivity |---------------
#=========================================================================
cask "notion"
cask "the-unarchiver"
cask "iterm2"
brew "nmap"
cask "pdf-squeezer"
cask "appcleaner"
cask "monitorcontrol"
cask "clipy"
cask "rectangle"
brew "neovim"
#=========================================================================
#      ---------------| DevOps Tools |---------------
#=========================================================================
# brew "awscli"
# brew "aws-iam-authenticator"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "ansible"
brew "kubectl"
brew "kubectx"
brew "helm"
brew "krew"
cask 'vnc-viewer'
brew "watch"
brew "stern"
brew "asciinema"
#cask "microsoft-remote-desktop"
brew "git"
brew "pre-commit"
brew "gh"
cask "transmit"
cask "boop"
brew "cdrtools"
brew "sops"
brew "argo"
brew "argocd"
brew "vault"
cask "intellij-idea"
brew "velero"
brew "kubent"
brew "eksctl"

#=========================================================================
#      ---------------| Mac Hacks |---------------
#=========================================================================
brew "mackup"
brew "mas"
brew "zsh"
brew "java"
brew "openjdk"
brew "glib"
brew "curl"
brew "ffmpeg"
brew "wget"
# brew "yt-dlp"
brew "zlib"
brew "jq"
brew "tree"
brew "eza"
#=========================================================================
#      ---------------| Messaging |---------------
#=========================================================================
# cask "skype"
# cask "whatsapp"
# cask "messenger"
# cask "slack"
cask "discord"
#=========================================================================
#      ---------------| Photo Video & Music |---------------
#=========================================================================
cask "imageoptim"
cask "vlc"
cask "spotify"
brew "imagemagick"
brew "jpegoptim"
brew "optipng"
#=========================================================================
#      ---------------| Writing & Blogging |---------------
#=========================================================================
cask "sublime-text"
cask "typora"
#=========================================================================
#      ---------------| Font |---------------
#=========================================================================
cask "font-camingocode"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-ubuntu-mono"
cask "font-ibm-plex-mono"
#=========================================================================
#      ---------------| AppStore |---------------
#=========================================================================
mas "Magnet", id: 441258766
mas "SnippetsLab", id: 1006087419
mas "Namecheap FastVPN", id: 1419729466
mas "Amphetamine", id: 937984704
mas "Strongbox", id: 1270075435
mas "iA Writer", id: 775737590
mas "DropOver", id: 1355679052
