#=========================================================================
#      ---------------| Tap |---------------
#=========================================================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Productivity |---------------
#=========================================================================
cask "notion"
cask "upic"
cask "the-unarchiver"
cask "anydesk"
cask "tunnelblick"
cask "google-chrome"
cask "iterm2"
brew "speedtest"
brew "iperf3"
brew "nmap"
cask "pdf-squeezer"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Developer Tools |---------------
#=========================================================================
brew "git"
brew "gh"
# cask "visual-studio-code"
# cask "phpstorm"
cask "transmit"
# cask "vagrant"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
brew "github-markdown-toc"
# brew "hugo"
# cask "boop"


# brew "nginx"
# brew "php@7.4"
# brew 'composer'
# brew "mysql"
# brew "memcached"
# brew 'libmemcached'
# brew "node"
# cask "postman"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| DevOps Tools |---------------
#=========================================================================
brew "awscli"
brew "aws-iam-authenticator"
brew "terraform"
brew "kubernetes-cli"
brew "kubectl"
brew "helm"
cask 'vnc-viewer'
brew "watch"
# brew "packer"
brew "stern"
brew "asciinema"
cask "microsoft-remote-desktop"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Mac Hacks |---------------
#=========================================================================
cask "appcleaner"
brew "mackup"
brew "mas"
brew "zsh"
brew "java"
brew "openjdk"
brew "glib"
brew "curl"
brew "dnsmasq"
brew "ffmpeg"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "jq"
brew "tree"
brew "exa"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Messaging |---------------
#=========================================================================
# cask "skype"
cask "whatsapp"
cask "messenger"
# cask "slack"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Photo Video & Music |---------------
#=========================================================================
cask "imageoptim"
cask "vlc"
cask "spotify"
brew "imagemagick"
brew "jpegoptim"
brew "optipng"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Writing & Blogging |---------------
#=========================================================================
cask "sublime-text"
cask "typora"
cask "grammarly"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| Font |---------------
#=========================================================================
cask "font-camingocode"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-noto-mono"
cask "font-noto-mono-for-powerline"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-bengali"
cask "font-roboto-mono-for-powerline"
cask "font-source-serif-pro"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-derivative-powerline"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| AppStore |---------------
#=========================================================================
mas "Magnet", id: 441258766
mas "SnippetsLab", id: 1006087419
mas "Namecheap FastVPN", id: 1419729466
mas "Amphetamine", id: 937984704
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
