#=========================================================================
#      ---------------| Tap |---------------
#=========================================================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Productivity |---------------
#=========================================================================
cask "notion"
cask "upic"
cask "the-unarchiver"
cask "anydesk"
cask "tunnelblick"
cask "google-chrome"
cask "iterm2"
brew "speedtest"
brew "iperf3"
brew "nmap"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Developer Tools |---------------
#=========================================================================
brew "git"
brew "gh"
cask "visual-studio-code"
cask "phpstorm"
cask "transmit"
brew "terraform"
cask "vagrant"
brew "packer"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask 'vnc-viewer'
brew "github-markdown-toc"

brew "nginx"
brew "php@7.4"
brew 'composer'
brew "mysql"
brew "memcached"
brew 'libmemcached'
brew "node"
cask "postman"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Mac Hacks |---------------
#=========================================================================
cask "appcleaner"
brew "mackup"
brew "mas"
brew "zsh"
cask "java"
brew "openjdk"
brew "glib"
brew "curl"
brew "dnsmasq"
brew "ffmpeg"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "jq"
brew "tree"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Messaging |---------------
#=========================================================================
cask "skype"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Photo Video & Music |---------------
#=========================================================================
cask "imageoptim"
cask "vlc"
cask "spotify"
brew "imagemagick"
brew "jpegoptim"
brew "optipng"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Writing & Blogging |---------------
#=========================================================================
cask "sublime-text"
cask "typora"
cask "grammarly"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]



#=========================================================================
#      ---------------| Font |---------------
#=========================================================================
cask "font-camingocode"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-noto-mono"
cask "font-noto-mono-for-powerline"
cask "font-noto-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-bengali"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-derivative-powerline"
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]


#=========================================================================
#      ---------------| AppStore |---------------
#=========================================================================
mas 'Whatsapp', id: 1147396723
mas "Messenger", id: 1480068668
mas "Magnet", id: 441258766
mas "SnippetsLab", id: 1006087419
mas "Boop", id: 1518425043
mas "Namecheap VPN", id: 1419729466
mas "Microsoft Remote Desktop", id: 1295203466
mas "Termius", id: 1176074088
#[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]